# SetOverriddenParameterReadonly Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerParameterManager..::..SetOverriddenParameterReadonly Method
RebarContainerParameterManager Class See Also
---
Sets this overridden parameter to be readonly.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void SetOverriddenParameterReadonly(
	ElementId paramId
)
```

Visual Basic
---
```text
Public Sub SetOverriddenParameterReadonly ( _
	paramId As ElementId _
)
```

Visual C++
---
```text
public:
void SetOverriddenParameterReadonly(
	ElementId^ paramId
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId Overridden parameter id
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | paramId has no override |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace